Public Attributes | List of all members
API_DrawingTitle Struct Reference
Element Manager API
Specifies the drawing's title object. More...
#include <APIdefs_Elements.h>
 Public Attributes
Int32  | libInd
Library part index of the title.
API_TitlePreviewModes  | previewMode
Show the title preview with or without the drawing itself (see API_TitlePreviewModes).
bool  | useUniformTextFormat
Use the fonts and style set on the title tabpage.
short  | font
Title common text font ID.
unsigned short  | faceBits
Plain, bold, italic, underline.
short  | textPen
Title common text pen.
double  | textSize
Title text size.
bool  | flipped
The title object is flipped.
bool  | useUniformSymbolPens
Use the pens set on the title tabpage.
short  | pen
Title common pen.
API_Guid  | guid
Guid of title element (the placed object).
Detailed Description
Specifies the drawing's title object.
Remarks
Drawing titles are now object based elements from Archicad 10.
Member Data Documentation
◆ faceBits
 API_DrawingTitle::faceBits
Plain, bold, italic, underline.
◆ flipped
 API_DrawingTitle::flipped
The title object is flipped.
◆ font
 API_DrawingTitle::font
Title common text font ID.
◆ guid
 API_DrawingTitle::guid
Guid of title element (the placed object).
◆ libInd
 API_DrawingTitle::libInd
Library part index of the title.
◆ pen
 API_DrawingTitle::pen
Title common pen.
◆ previewMode
 API_DrawingTitle::previewMode
Show the title preview with or without the drawing itself (see API_TitlePreviewModes).
◆ textPen
 API_DrawingTitle::textPen
Title common text pen.
◆ textSize
 API_DrawingTitle::textSize
Title text size.
◆ useUniformSymbolPens
 API_DrawingTitle::useUniformSymbolPens
Use the pens set on the title tabpage.
◆ useUniformTextFormat
 API_DrawingTitle::useUniformTextFormat
Use the fonts and style set on the title tabpage.